import { v4 } from "uuid";
import {
  createSeededRandom,
  getRandomFromArray,
  getSomeRandomFromArray,
  shuffleArray,
  uuidToFloat,
} from "../utils";

const TYPO_MAP: Record<string, string[]> = {
  а: ["о", "я", "ах"],
  б: ["п", "в", "6"],
  в: ["ф", "б", "у"],
  г: ["к", "х", "гы"],
  д: ["т", "л"],
  е: ["и", "э", "ё", "ие"],
  ё: ["е", "о", "йо"],
  ж: ["ш", "з", "жы"],
  з: ["с", "ж"],
  и: ["е", "ы", "ыи"],
  й: ["и", "йй"],
  к: ["г", "х"],
  л: ["р", "д", "у"],
  м: ["н", "эм"],
  н: ["м", "л"],
  о: ["а", "оу"],
  п: ["б", "р"],
  р: ["л", "д"],
  с: ["з", "ц"],
  т: ["д", "ть"],
  у: ["ю", "в"],
  ф: ["в", "х"],
  х: ["г", "к", "ф"],
  ц: ["с", "ч", "тс"],
  ч: ["щ", "ц"],
  ш: ["ж", "щ", "шы"],
  щ: ["ш", "ч"],
  ъ: ["ь"],
  ы: ["и"],
  ь: ["ъ"],
  э: ["е"],
  ю: ["у", "юу"],
  я: ["йа", "йэ"],
};

const CAPTCHA_ITEMS: [string, string[]][] = [
  [
    "🍎",
    [
      "яблоко",
      "красный круглый фрукт",
      "фрукт с семечками",
      "круглое, румяное, я с дерева упало",
    ],
  ],
  [
    "🍌",
    [
      "банан",
      "длинный желтый фрукт",
      "фрукт с пальмы",
      "желтый полумесяц, который любят обезьяны",
    ],
  ],
  [
    "🍕",
    [
      "пицца",
      "итальянское блюдо",
      "еда с сыром и тестом",
      "круг режем на треугольники, коробка квадратная",
    ],
  ],
  [
    "🚗",
    [
      "машина",
      "автомобиль",
      "транспортное средство",
      "бибика",
      "стоит в пробках",
      "четыре колеса, руль да дорога",
    ],
  ],
  [
    "🐶",
    [
      "собака",
      "раньше был волк",
      "лающее животное",
      "гавкает",
      "лучший друг человека",
    ],
  ],
  [
    "🐱",
    [
      "кошка",
      "мяукающее животное",
      "киса",
      "кисонька",
      "сама по себе гуляет, мышей пугает",
    ],
  ],
  [
    "🎸",
    [
      "гитара",
      "музыкальный инструмент",
      "струнный инструмент",
      "еее рокккк",
      "шесть струн и звонкий голос",
    ],
  ],
  [
    "🚀",
    [
      "ракета",
      "космический корабль",
      "летательный аппарат",
      "летит к звездам быстрее звука",
    ],
  ],
  [
    "🍄",
    [
      "гриб",
      "растет на мицелии",
      "съедобный или ядовитый",
      "стоит на одной ножке в лесу под листочком",
    ],
  ],
  [
    "☀️",
    [
      "солнце",
      "звезда",
      "источник света и тепла",
      "днем светит, а ночью спать уходит",
    ],
  ],
  [
    "🔑",
    [
      "ключ",
      "открывает замок",
      "хорошо подходит двери",
      "замочек откроет, в кармане звенит",
    ],
  ],
  [
    "🎁",
    [
      "подарок",
      "сюрприз",
      "упакованная вещь",
      "можно подарить",
      "в яркой бумаге с пышным бантом",
    ],
  ],
  [
    "🌵",
    [
      "кактус",
      "колючее растение",
      "растение пустыни",
      "может жить долго без воды",
      "зеленый ежик в сердце пустыни",
    ],
  ],
  [
    "⚓️",
    [
      "якорь",
      "морской символ",
      "удерживает корабль",
      "на дно падает — корабль держит",
    ],
  ],
  [
    "🎈",
    [
      "шарик",
      "воздушный шар",
      "летает с гелием",
      "красный и круглый на веревочке",
      "легкий, как воздух, за ниточку держится",
    ],
  ],
  [
    "📱",
    [
      "телефон",
      "смартфон",
      "мобильное устройство",
      "можно позвонить",
      "нокиа блекберри самсунг айфон виво",
    ],
  ],
  [
    "👓",
    [
      "очки",
      "оптический прибор",
      "для улучшения зрения",
      "два стекла посередине палочка",
      "на носу сидят, на мир глядят",
    ],
  ],
  [
    "💎",
    [
      "алмаз",
      "бриллиант",
      "драгоценный камень",
      "лучшие друзья девушек",
      "тверже всех на свете, ярко блестит",
    ],
  ],
  [
    "🍉",
    [
      "арбуз",
      "большая ягода",
      "сладкий и сочный",
      "зеленый с красной мякотью и косточками",
      "сверху полосатый, а внутри сахарный",
    ],
  ],
  [
    "🌋",
    [
      "вулкан",
      "огнедышащая гора",
      "извергает лаву",
      "гора с дыркой",
      "гора сердится, огнем плюется",
    ],
  ],
  [
    "🧊",
    [
      "ледышка",
      "кусок льда",
      "холодный и прозрачный",
      "холодный кубик льда кинь в меня",
      "зимой — гора, летом — вода",
    ],
  ],
  [
    "🦉",
    [
      "сова",
      "ночная птица",
      "мудрая птица",
      "фиолетовая птица в смешариках",
      "днем спит, ночью летает, глазами сверкает",
    ],
  ],
  [
    "🐢",
    [
      "черепаха",
      "медленное животное",
      "с панцирем",
      "в мультиках гоняется с зайцем",
      "свой дом на спине носит",
    ],
  ],
  [
    "🐝",
    [
      "пчела",
      "летающее насекомое",
      "собирает мед",
      "жужжит и жалит",
      "живет в улье",
      "полосатая труженица нектар собирает",
    ],
  ],
] as const;

function corruptString(word: string, getRandom: () => number): string {
  const chars = word.split("");
  const len = chars.length;

  const replacementsCount = Math.round(len / 4);

  const targetIndices = new Set<number>();

  while (targetIndices.size < replacementsCount) {
    const randomIndex = Math.floor(getRandom() * len);
    if (targetIndices.has(randomIndex)) {
      continue;
    }
    targetIndices.add(randomIndex);
  }

  return chars
    .map((char, index) =>
      targetIndices.has(index) && char in TYPO_MAP
        ? getRandomFromArray(TYPO_MAP[char], getRandom)
        : char,
    )
    .join("");
}

export const createCaptcha = (uuid: string = v4(), count = 6) => {
  const key = uuidToFloat(uuid);
  const randomizer = createSeededRandom(key);
  const items = getSomeRandomFromArray(CAPTCHA_ITEMS, count, randomizer);
  const targetId = key % count;
  const targetItem = items[targetId];
  const textsLen = targetItem[1].length;
  const targetText = targetItem[1][key % textsLen];

  return {
    pattern: corruptString(targetText, randomizer),
    targetId: targetId,
    items: shuffleArray(
      items.map(([emoji], id) => ({ text: emoji, data: id })),
      Math.random,
    ),
  };
};

if (import.meta.main) {
  CAPTCHA_ITEMS.forEach(([emoji, words]) => {
    console.log(`${emoji}`);
    words.forEach((word) => {
      console.log(`${word} -> ${corruptString(word, Math.random)}`);
    });
  });
}
